This Notebook covers the basics of SQL. This does the same things as the Instabase Notebook, but connects to your local instance of PostgreSQL instead. So you can edit and run queries against the database. You should also make sure that you are comfortable using SQL through `psql` (see the [Setup Instructions](https://github.com/umddb/cmsc424-fall2016/tree/master/project0) to get started with that).

The server should already be running (and the `university` database created and populated). The following commands load the requiste modules. 

**NOTE: Although there is a warning, it doesn't seem to affect things.**

In [1]:
%load_ext sql
%sql postgresql://vagrant:vagrant@localhost/university

/usr/local/lib/python2.7/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/usr/local/lib/python2.7/dist-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

u'Connected: vagrant@university'

We can now run SQL commands using `magic` commands, which is an extensibility mechanism provided by Jupyter. %sql is for single-line commands, whereas %%sql allows us to do multi-line SQL commands.

In [3]:
%sql select * from instructor;

50 rows affected.

[(u'63395', u'McKinnon', u'Cybernetics', Decimal('94333.99')),
 (u'78699', u'Pingr', u'Statistics', Decimal('59303.62')),
 (u'96895', u'Mird', u'Marketing', Decimal('119921.41')),
 (u'4233', u'Luo', u'English', Decimal('88791.45')),
 (u'4034', u'Murata', u'Athletics', Decimal('61387.56')),
 (u'50885', u'Konstantinides', u'Languages', Decimal('32570.50')),
 (u'79653', u'Levine', u'Elec. Eng.', Decimal('89805.83')),
 (u'50330', u'Shuming', u'Physics', Decimal('108011.81')),
 (u'80759', u'Queiroz', u'Biology', Decimal('45538.32')),
 (u'73623', u'Sullivan', u'Elec. Eng.', Decimal('90038.09')),
 (u'97302', u'Bertolino', u'Mech. Eng.', Decimal('51647.57')),
 (u'57180', u'Hau', u'Accounting', Decimal('43966.29')),
 (u'74420', u'Voronina', u'Physics', Decimal('121141.99')),
 (u'35579', u'Soisalon-Soininen', u'Psychology', Decimal('62579.61')),
 (u'31955', u'Moreira', u'Accounting', Decimal('71351.42')),
 (u'37687', u'Arias', u'Statistics', Decimal('104563.38')),
 (u'6569', u'Mingoz', u'Finance', Decimal('105311.38')),
 (u'16807', u'Yazdi', u'Athletics', Decimal('98333.65')),
 (u'14365', u'Lembr', u'Accounting', Decimal('32241.56')),
 (u'90643', u'Choll', u'Statistics', Decimal('57807.09')),
 (u'81991', u'Valtchev', u'Biology', Decimal('77036.18')),
 (u'95030', u'Arinb', u'Statistics', Decimal('54805.11')),
 (u'15347', u'Bawa', u'Athletics', Decimal('72140.88')),
 (u'74426', u'Kenje', u'Marketing', Decimal('106554.73')),
 (u'42782', u'Vicentino', u'Elec. Eng.', Decimal('34272.67')),
 (u'58558', u'Dusserre', u'Marketing', Decimal('66143.25')),
 (u'63287', u'Jaekel', u'Athletics', Decimal('103146.87')),
 (u'59795', u'Desyl', u'Languages', Decimal('48803.38')),
 (u'22591', u'DAgostino', u'Psychology', Decimal('59706.49')),
 (u'48570', u'Sarkar', u'Pol. Sci.', Decimal('87549.80')),
 (u'79081', u'Ullman ', u'Accounting', Decimal('47307.10')),
 (u'52647', u'Bancilhon', u'Pol. Sci.', Decimal('87958.01')),
 (u'25946', u'Liley', u'Languages', Decimal('90891.69')),
 (u'36897', u'Morris', u'Marketing', Decimal('43770.36')),
 (u'72553', u'Yin', u'English', Decimal('46397.59')),
 (u'3199', u'Gustafsson', u'Elec. Eng.', Decimal('82534.37')),
 (u'34175', u'Bondi', u'Comp. Sci.', Decimal('115469.11')),
 (u'48507', u'Lent', u'Mech. Eng.', Decimal('107978.47')),
 (u'65931', u'Pimenta', u'Cybernetics', Decimal('79866.95')),
 (u'3335', u'Bourrier', u'Comp. Sci.', Decimal('80797.83')),
 (u'64871', u'Gutierrez', u'Statistics', Decimal('45310.53')),
 (u'95709', u'Sakurai', u'English', Decimal('118143.98')),
 (u'43779', u'Romero', u'Astronomy', Decimal('79070.08')),
 (u'77346', u'Mahmoud', u'Geology', Decimal('99382.59')),
 (u'28097', u'Kean', u'English', Decimal('35023.18')),
 (u'90376', u'Bietzk', u'Cybernetics', Decimal('117836.50')),
 (u'28400', u'Atanassov', u'Statistics', Decimal('84982.92')),
 (u'41930', u'Tung', u'Athletics', Decimal('50482.03')),
 (u'19368', u'Wieland', u'Pol. Sci.', Decimal('124651.41')),
 (u'99052', u'Dale', u'Cybernetics', Decimal('93348.83'))]

### Inspecting the Database
One drawback of this way of accessing the database is that we can only run valid SQL -- the commands like `\d` provided by `psql` are not available to us. Instead, we will need to query the system catalog (metadata) directly. The first command below is equivalent to `\d`, whereas the second one is similar to `\d instructor`.

In [4]:
%%sql
SELECT table_schema, table_name FROM information_schema.tables
    WHERE table_type = 'BASE TABLE' AND
    table_schema NOT IN ('pg_catalog', 'information_schema', 'priv');

11 rows affected.

[(u'public', u'classroom'),
 (u'public', u'department'),
 (u'public', u'time_slot'),
 (u'public', u'instructor'),
 (u'public', u'teaches'),
 (u'public', u'section'),
 (u'public', u'student'),
 (u'public', u'takes'),
 (u'public', u'advisor'),
 (u'public', u'course'),
 (u'public', u'prereq')]

In [6]:
%%sql
SELECT column_name, data_type
    FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'instructor';

4 rows affected.

[(u'id', u'character varying'),
 (u'name', u'character varying'),
 (u'dept_name', u'character varying'),
 (u'salary', u'numeric')]

### University Database
Below we will use the University database from the class textbook. The University Dataset is the same as the one discussed in the book, and contains randomly populated information about the students, courses, and instructors in a university. 

You should follow the rest of the Notebook along with the appropriate sections in the book.

The schema diagram for the database is as follows:
<center><img src="https://github.com/umddb/cmsc424-fall2015/raw/master/postgresql-setup/university.png" width=800px></center>

### SQL Data Definition Language (Section 3.2)

You can take a look at the `DDL.sql` file to see how the tables we are using are created. We won't try to run those commands here since they will only give errors. 
Here is how the department table is created. The `primary key` is specified using the special clause.
```
create table department
        (dept_name              varchar(20),
         building               varchar(15),
         budget                 numeric(12,2) check (budget > 0),
         primary key (dept_name)
        );
```

The instructor table is created simiarly and it references the primary key of the department (and hence called `foreign key`).
```
create table instructor
        (ID                     varchar(5),
         name                   varchar(20) not null,
         dept_name              varchar(20),
         salary                 numeric(8,2) check (salary > 29000),
         primary key (ID),
         foreign key (dept_name) references department
                on delete set null
        );
```
Command for inserting a new instructor is also straightforward.
```
insert into instructor values ('10101', 'Srinivasan', 'Comp. Sci.', '65000');
```
If the 'Comp. Sci.' department is not present in the `department` table already, we have a `referential integrity violation`, and the insert command would be rejected.

### Select Queries on a Single Relation (Section 3.3.1)
Let's start with the most basic queries. The following query reports the courses with titles containing Biology.

In [7]:
%sql select * from course where title like '%Biology%';

2 rows affected.

[(u'BIO-101', u'Intro. to Biology', u'Biology', Decimal('4')),
 (u'BIO-399', u'Computational Biology', u'Biology', Decimal('3'))]

There are two  courses. How many students are enrolled in the first one (ever)? What about in Summer 2009?

In [8]:
%sql select * from takes where course_id = 'BIO-101';

1 rows affected.

[(u'98988', u'BIO-101', u'1', u'Summer', Decimal('2009'), u'A')]

In [9]:
%sql select * from takes where course_id = 'BIO-101'  and year = 2009 and semester = 'Summer';

1 rows affected.

[(u'98988', u'BIO-101', u'1', u'Summer', Decimal('2009'), u'A')]

### Aggregates

Count the number of instructors in Finance

In [10]:
%sql select count(*) from instructor where dept_name = 'Finance';

1 rows affected.

[(2L,)]

Find the instructor(s) with the highest salary. Note that using a nested "subquery" (which first finds the maximum value of the salary) as below is the most compact way to write this query.

In [11]:
%%sql 
select *
from instructor
where salary = (select max(salary) from instructor);

1 rows affected.

[(u'22222', u'Einstein', u'Physics', Decimal('95000.00'))]

### Joins and Cartesian Product (Section 3.3.2)
To find building names for all instructors, we must do a join between two relations.

In [12]:
%%sql
select name, instructor.dept_name, building
from instructor, department
where instructor.dept_name = department.dept_name;

12 rows affected.

[(u'Srinivasan', u'Comp. Sci.', u'Taylor'),
 (u'Wu', u'Finance', u'Painter'),
 (u'Mozart', u'Music', u'Packard'),
 (u'Einstein', u'Physics', u'Watson'),
 (u'El Said', u'History', u'Painter'),
 (u'Gold', u'Physics', u'Watson'),
 (u'Katz', u'Comp. Sci.', u'Taylor'),
 (u'Califieri', u'History', u'Painter'),
 (u'Singh', u'Finance', u'Painter'),
 (u'Crick', u'Biology', u'Watson'),
 (u'Brandt', u'Comp. Sci.', u'Taylor'),
 (u'Kim', u'Elec. Eng.', u'Taylor')]

Since the join here is a equality join on the common attributes in the two relations, we can also just do:

In [13]:
%%sql 
select name, instructor.dept_name, building
from instructor natural join department;

12 rows affected.

[(u'Srinivasan', u'Comp. Sci.', u'Taylor'),
 (u'Wu', u'Finance', u'Painter'),
 (u'Mozart', u'Music', u'Packard'),
 (u'Einstein', u'Physics', u'Watson'),
 (u'El Said', u'History', u'Painter'),
 (u'Gold', u'Physics', u'Watson'),
 (u'Katz', u'Comp. Sci.', u'Taylor'),
 (u'Califieri', u'History', u'Painter'),
 (u'Singh', u'Finance', u'Painter'),
 (u'Crick', u'Biology', u'Watson'),
 (u'Brandt', u'Comp. Sci.', u'Taylor'),
 (u'Kim', u'Elec. Eng.', u'Taylor')]

On the other hand, just doing the following (i.e., just the Cartesian Product) will lead to a large number of tuples, most of which are not meaningful.

In [14]:
%%sql
select name, instructor.dept_name, building
from instructor, department;

84 rows affected.

[(u'Srinivasan', u'Comp. Sci.', u'Watson'),
 (u'Wu', u'Finance', u'Watson'),
 (u'Mozart', u'Music', u'Watson'),
 (u'Einstein', u'Physics', u'Watson'),
 (u'El Said', u'History', u'Watson'),
 (u'Gold', u'Physics', u'Watson'),
 (u'Katz', u'Comp. Sci.', u'Watson'),
 (u'Califieri', u'History', u'Watson'),
 (u'Singh', u'Finance', u'Watson'),
 (u'Crick', u'Biology', u'Watson'),
 (u'Brandt', u'Comp. Sci.', u'Watson'),
 (u'Kim', u'Elec. Eng.', u'Watson'),
 (u'Srinivasan', u'Comp. Sci.', u'Taylor'),
 (u'Wu', u'Finance', u'Taylor'),
 (u'Mozart', u'Music', u'Taylor'),
 (u'Einstein', u'Physics', u'Taylor'),
 (u'El Said', u'History', u'Taylor'),
 (u'Gold', u'Physics', u'Taylor'),
 (u'Katz', u'Comp. Sci.', u'Taylor'),
 (u'Califieri', u'History', u'Taylor'),
 (u'Singh', u'Finance', u'Taylor'),
 (u'Crick', u'Biology', u'Taylor'),
 (u'Brandt', u'Comp. Sci.', u'Taylor'),
 (u'Kim', u'Elec. Eng.', u'Taylor'),
 (u'Srinivasan', u'Comp. Sci.', u'Taylor'),
 (u'Wu', u'Finance', u'Taylor'),
 (u'Mozart', u'Music', u'Taylor'),
 (u'Einstein', u'Physics', u'Taylor'),
 (u'El Said', u'History', u'Taylor'),
 (u'Gold', u'Physics', u'Taylor'),
 (u'Katz', u'Comp. Sci.', u'Taylor'),
 (u'Califieri', u'History', u'Taylor'),
 (u'Singh', u'Finance', u'Taylor'),
 (u'Crick', u'Biology', u'Taylor'),
 (u'Brandt', u'Comp. Sci.', u'Taylor'),
 (u'Kim', u'Elec. Eng.', u'Taylor'),
 (u'Srinivasan', u'Comp. Sci.', u'Painter'),
 (u'Wu', u'Finance', u'Painter'),
 (u'Mozart', u'Music', u'Painter'),
 (u'Einstein', u'Physics', u'Painter'),
 (u'El Said', u'History', u'Painter'),
 (u'Gold', u'Physics', u'Painter'),
 (u'Katz', u'Comp. Sci.', u'Painter'),
 (u'Califieri', u'History', u'Painter'),
 (u'Singh', u'Finance', u'Painter'),
 (u'Crick', u'Biology', u'Painter'),
 (u'Brandt', u'Comp. Sci.', u'Painter'),
 (u'Kim', u'Elec. Eng.', u'Painter'),
 (u'Srinivasan', u'Comp. Sci.', u'Painter'),
 (u'Wu', u'Finance', u'Painter'),
 (u'Mozart', u'Music', u'Painter'),
 (u'Einstein', u'Physics', u'Painter'),
 (u'El Said', u'History', u'Painter'),
 (u'Gold', u'Physics', u'Painter'),
 (u'Katz', u'Comp. Sci.', u'Painter'),
 (u'Califieri', u'History', u'Painter'),
 (u'Singh', u'Finance', u'Painter'),
 (u'Crick', u'Biology', u'Painter'),
 (u'Brandt', u'Comp. Sci.', u'Painter'),
 (u'Kim', u'Elec. Eng.', u'Painter'),
 (u'Srinivasan', u'Comp. Sci.', u'Packard'),
 (u'Wu', u'Finance', u'Packard'),
 (u'Mozart', u'Music', u'Packard'),
 (u'Einstein', u'Physics', u'Packard'),
 (u'El Said', u'History', u'Packard'),
 (u'Gold', u'Physics', u'Packard'),
 (u'Katz', u'Comp. Sci.', u'Packard'),
 (u'Califieri', u'History', u'Packard'),
 (u'Singh', u'Finance', u'Packard'),
 (u'Crick', u'Biology', u'Packard'),
 (u'Brandt', u'Comp. Sci.', u'Packard'),
 (u'Kim', u'Elec. Eng.', u'Packard'),
 (u'Srinivasan', u'Comp. Sci.', u'Watson'),
 (u'Wu', u'Finance', u'Watson'),
 (u'Mozart', u'Music', u'Watson'),
 (u'Einstein', u'Physics', u'Watson'),
 (u'El Said', u'History', u'Watson'),
 (u'Gold', u'Physics', u'Watson'),
 (u'Katz', u'Comp. Sci.', u'Watson'),
 (u'Califieri', u'History', u'Watson'),
 (u'Singh', u'Finance', u'Watson'),
 (u'Crick', u'Biology', u'Watson'),
 (u'Brandt', u'Comp. Sci.', u'Watson'),
 (u'Kim', u'Elec. Eng.', u'Watson')]

### Renaming using "as"
**as** can be used to rename tables and simplify queries:

In [8]:
%%sql
explain select distinct T.name
from instructor as T, instructor as S  
where T.salary > S.salary and S.dept_name = 'Biology';

7 rows affected.

[(u'HashAggregate  (cost=43.84..45.84 rows=200 width=58)',),
 (u'  ->  Nested Loop  (cost=0.00..43.10 rows=293 width=58)',),
 (u'        Join Filter: (t.salary > s.salary)',),
 (u'        ->  Seq Scan on instructor t  (cost=0.00..14.40 rows=440 width=72)',),
 (u'        ->  Materialize  (cost=0.00..15.51 rows=2 width=14)',),
 (u'              ->  Seq Scan on instructor s  (cost=0.00..15.50 rows=2 width=14)',),
 (u"                    Filter: ((dept_name)::text = 'Biology'::text)",)]

**Self-joins** (where two of the relations in the from clause are the same) are impossible without using `as`. The following query associates a course with the pre-requisite of one of its pre-requisites. There is no way to disambiguate the columns without some form of renaming.

In [9]:
%%sql
explain analyze select p1.course_id, p2.prereq_id as pre_prereq_id
from prereq p1, prereq p2
where p1.prereq_id = p2.course_id;

7 rows affected.

[(u'Hash Join  (cost=3.25..7.08 rows=121 width=8) (actual time=0.036..0.058 rows=56 loops=1)',),
 (u'  Hash Cond: ((p1.prereq_id)::text = (p2.course_id)::text)',),
 (u'  ->  Seq Scan on prereq p1  (cost=0.00..2.00 rows=100 width=8) (actual time=0.003..0.007 rows=100 loops=1)',),
 (u'  ->  Hash  (cost=2.00..2.00 rows=100 width=8) (actual time=0.026..0.026 rows=100 loops=1)',),
 (u'        Buckets: 1024  Batches: 1  Memory Usage: 4kB',),
 (u'        ->  Seq Scan on prereq p2  (cost=0.00..2.00 rows=100 width=8) (actual time=0.002..0.009 rows=100 loops=1)',),
 (u'Total runtime: 0.076 ms',)]

The small University database doesn't have any chains of this kind. You can try adding a new tuple using a new tuple. Now the query will return an answer.

In [22]:
%sql insert into prereq values ('CS-101', 'PHY-101');

1 rows affected.

[]

In [23]:
%%sql
select p1.course_id, p2.prereq_id as pre_prereq_id
from prereq p1, prereq p2
where p1.prereq_id = p2.course_id;

4 rows affected.

[(u'CS-190', u'PHY-101'),
 (u'CS-315', u'PHY-101'),
 (u'CS-319', u'PHY-101'),
 (u'CS-347', u'PHY-101')]

### Set Operations
*Union* operation can be used to combine information from two tables (from Section 3.5.1).

In [17]:
%%sql
select course_id
from section
where semester = 'Fall' and year= 2009
union 
select course_id
from section
where semester = 'Spring' and year= 2010;

8 rows affected.

[(u'CS-101',),
 (u'CS-315',),
 (u'CS-319',),
 (u'CS-347',),
 (u'FIN-201',),
 (u'HIS-351',),
 (u'MU-199',),
 (u'PHY-101',)]

### Aggregation with Grouping (Section 7.4.2)

In [18]:
%%sql
select dept_name, avg(salary) as avg_salary
from instructor
group by dept_name;

7 rows affected.

[(u'Comp. Sci.', Decimal('77333.333333333333')),
 (u'Elec. Eng.', Decimal('80000.000000000000')),
 (u'History', Decimal('61000.000000000000')),
 (u'Music', Decimal('40000.000000000000')),
 (u'Finance', Decimal('85000.000000000000')),
 (u'Physics', Decimal('91000.000000000000')),
 (u'Biology', Decimal('72000.000000000000'))]

You can use `having` to filter out groups. The following query only returns the average salary for departments with more than 2 instructors.

In [19]:
%%sql
select dept_name, avg(salary) as avg_salary
from instructor
group by dept_name
having count(*) > 2;

1 rows affected.

[(u'Comp. Sci.', Decimal('77333.333333333333'))]

### WITH
In many cases you might find it easier to create temporary tables, especially for queries involving finding "max" or "min". This also allows you to break down the full query and makes it easier to debug. It is preferable to use the WITH construct for this purpose. The syntax and support differs across systems, but here is the link to PostgreSQL: http://www.postgresql.org/docs/9.0/static/queries-with.html

These are also called Common Table Expressions (CTEs).

The following query is from Section 3.8.6.

In [20]:
%%sql
with max_budget(value) as (
select max(budget)
from department
)
select budget
from department, max_budget
where department.budget = max_budget.value;

1 rows affected.

[(Decimal('120000.00'),)]

### LIMIT
PostgreSQL allows you to limit the number of results displayed which
is useful for debugging etc. Here is an example.

In [4]:
%sql select * from instructor limit 2;

2 rows affected.

[(u'10101', u'Srinivasan', u'Comp. Sci.', Decimal('65000.00')),
 (u'12121', u'Wu', u'Finance', Decimal('90000.00'))]

### Try your own queries
Feel free to use the cells below to write new queries. You can also just modify the above queries directly if you'd like.